src/Reports/ОтчётПоПричинамПростоя/ОтчётПоПричинамПростоя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоПричинамПростоя</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ДанныеПроизводственногоКалендаря/ДанныеПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПроизводственногоКалендаря</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПаспортЛинейки/ПаспортЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортЛинейки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяТактаМаксимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаМинимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаРасчётное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыпускЗаДеньРасчётный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ТехническийЛидер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПростойЛинейки/ПростойЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПростойЛинейки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Остановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Причина</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ПричиныОстановок</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчётПоПричинамПростоя/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьВремяРаботыЛинейки(Линейка)
РабочееВремяОбщее = 0;
ВыбДата = Отчет.Период.ДатаНачала;
	Пока ВыбДата <= Отчет.Период.ДатаОкончания Цикл
	Отбор = Новый Структура("ПроизводственныйКалендарь,Дата,Год",Константы.ОсновнойПроизводственныйКалендарь.Получить(),ВыбДата,Год(ВыбДата));
	Выборка = РегистрыСведений.ДанныеПроизводственногоКалендаря.Получить(Отбор);
		Если Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
		Отбор = Новый Структура("Линейка",Линейка);
		ПаспортЛинейки = РегистрыСведений.ПаспортЛинейки.ПолучитьПоследнее(ВыбДата,Отбор);
		РабочееВремяОбщее = РабочееВремяОбщее + ПаспортЛинейки.Смена;		
		КонецЕсли;
	ВыбДата = ВыбДата + 86400;	
	КонецЦикла; 
Возврат(РабочееВремяОбщее);
КонецФункции 

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Макет = Отчеты.ОтчётПоПричинамПростоя.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблЛинейкаИтого = Макет.ПолучитьОбласть("ЛинейкаИтого");
ОблПричинаПростоя = Макет.ПолучитьОбласть("ПричинаПростоя");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
	Если Параметр = 1 Тогда
	ОблШапка.Параметры.Параметр = "Часов";
	ИначеЕсли Параметр = 2 Тогда
	ОблШапка.Параметры.Параметр = "Минут";
	Иначе
	ОблШапка.Параметры.Параметр = "% от продолжительности смены";
	КонецЕсли;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПростойЛинейки.Линейка КАК Линейка,
	|	ПростойЛинейки.Причина КАК Причина,
	|	ПростойЛинейки.Период,
	|	ПростойЛинейки.Окончание
	|ИЗ
	|	РегистрСведений.ПростойЛинейки КАК ПростойЛинейки
	|ГДЕ
	|	ПростойЛинейки.Период МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокЛинеек.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ПростойЛинейки.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	КонецЕсли;
		Если СписокПричинПростоя.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПростойЛинейки.Причина В(&СписокПричинПростоя)";
		Запрос.УстановитьПараметр("СписокПричинПростоя",СписокПричинПростоя);		
		КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
Результат = Запрос.Выполнить();
ТаблицаПростоев = Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
ТаблицаПростоев.Колонки.Добавить("ВремяПростоя",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
	Для каждого ТЧ Из ТаблицаПростоев Цикл
	//ТЧ.ВремяПростоя = ?(ЗначениеЗаполнено(ТЧ.Окончание),(ТЧ.Окончание - ТЧ.Период)/60,0);
	ТЧ.ВремяПростоя = ?(ЗначениеЗаполнено(ТЧ.Окончание),ОбщийМодульВызовСервера.ПолучитьВремяМеждуДатами(ТЧ.Период,ТЧ.Окончание,2,ВычестьНерабочееВремя,КолНерабочихЧасов,БезВыходных),0);
	КонецЦикла;
ТекЛинейка = Справочники.Линейки.ПустаяСсылка();
РабочееВремяОбщее = 0;
	Если ГруппироватьПоЛинейкам Тогда
	ТаблицаПростоев.Свернуть("Линейка,Причина","ВремяПростоя");		
		Если СортироватьПо = 1 Тогда
		ТаблицаПростоев.Сортировать("Линейка,Причина");
		ИначеЕсли СортироватьПо = 2 Тогда
		ТаблицаПростоев.Сортировать("Линейка,ВремяПростоя");
		Иначе
		ТаблицаПростоев.Сортировать("Линейка,ВремяПростоя Убыв");
		КонецЕсли; 
	Иначе
	ТаблицаПростоев.Свернуть("Причина","ВремяПростоя");
		Если СортироватьПо = 1 Тогда
		ТаблицаПростоев.Сортировать("Причина");
		ИначеЕсли СортироватьПо = 2 Тогда
		ТаблицаПростоев.Сортировать("ВремяПростоя");
		Иначе
		ТаблицаПростоев.Сортировать("ВремяПростоя Убыв");
		КонецЕсли;
			Для каждого Стр Из СписокЛинеек Цикл
			РабочееВремяОбщее = РабочееВремяОбщее + ПолучитьВремяРаботыЛинейки(Стр.Значение);
			КонецЦикла;
	КонецЕсли;
КолПарам = 0; 
ВремяПростояИтого = 0;
ВремяПростояВсего = 0;
РабочееВремяЛинейки = 0;
	Для каждого ТЧ Из ТаблицаПростоев Цикл
		Если ГруппироватьПоЛинейкам Тогда
			Если ТекЛинейка <> ТЧ.Линейка Тогда
				Если Не ТекЛинейка.Пустая() Тогда
					Если Параметр = 1 Тогда
					ОблЛинейкаИтого.Параметры.КолПарамИтого = Окр(ВремяПростояИтого/60,2,1);
					ИначеЕсли Параметр = 2 Тогда
					ОблЛинейкаИтого.Параметры.КолПарамИтого = ВремяПростояИтого;
					Иначе
					ОблЛинейкаИтого.Параметры.КолПарамИтого = Окр(ВремяПростояИтого*100/РабочееВремяЛинейки,2,1);
					КонецЕсли;
				ТабДок.Вывести(ОблЛинейкаИтого);				
				КонецЕсли;
			РабочееВремяЛинейки = ПолучитьВремяРаботыЛинейки(ТЧ.Линейка);
			РабочееВремяОбщее = РабочееВремяОбщее + РабочееВремяЛинейки;
			ОблЛинейка.Параметры.Линейка = ""+ТЧ.Линейка + " ("+ТЧ.Линейка.Комментарий+")";
			ТабДок.Вывести(ОблЛинейка);		
			ТекЛинейка = ТЧ.Линейка;
			ВремяПростояИтого = 0;
			КонецЕсли;
				Если Параметр = 1 Тогда
				КолПарам = Окр(ТЧ.ВремяПростоя/60,2,1);
				ИначеЕсли Параметр = 2 Тогда
				КолПарам = ТЧ.ВремяПростоя;
				Иначе
				КолПарам = Окр(ТЧ.ВремяПростоя*100/РабочееВремяЛинейки,2,1);
				КонецЕсли; 
		Иначе
			Если Параметр = 1 Тогда
			КолПарам = Окр(ТЧ.ВремяПростоя/60,2,1);
			ИначеЕсли Параметр = 2 Тогда
			КолПарам = ТЧ.ВремяПростоя;
			Иначе
			КолПарам = Окр(ТЧ.ВремяПростоя*100/РабочееВремяОбщее,2,1);
			КонецЕсли; 
		КонецЕсли;
	ОблПричинаПростоя.Параметры.ПричинаПростоя = ТЧ.Причина;
	ОблПричинаПростоя.Параметры.КолПарам = КолПарам;
	ТабДок.Вывести(ОблПричинаПростоя);
	ВремяПростояИтого = ВремяПростояИтого + ТЧ.ВремяПростоя;
	ВремяПростояВсего = ВремяПростояВсего + ТЧ.ВремяПростоя;
	КонецЦикла;
		Если ГруппироватьПоЛинейкам Тогда
			Если Параметр = 1 Тогда
			ОблЛинейкаИтого.Параметры.КолПарамИтого = Окр(ВремяПростояИтого/60,2,1);
			ИначеЕсли Параметр = 2 Тогда
			ОблЛинейкаИтого.Параметры.КолПарамИтого = ВремяПростояИтого;
			Иначе
			ОблЛинейкаИтого.Параметры.КолПарамИтого = Окр(ВремяПростояИтого*100/РабочееВремяЛинейки,2,1);
			КонецЕсли;
		ТабДок.Вывести(ОблЛинейкаИтого);										
		КонецЕсли; 
			Если Параметр = 1 Тогда
			ОблКонец.Параметры.КолПарамВсего = Окр(ВремяПростояВсего/60,2,1);
			ИначеЕсли Параметр = 2 Тогда
			ОблКонец.Параметры.КолПарамВсего = ВремяПростояВсего;
			Иначе
			ОблКонец.Параметры.КолПарамВсего = ?(РабочееВремяОбщее > 0,Окр(ВремяПростояВсего*100/РабочееВремяОбщее,2,1),0);
			КонецЕсли; 
ТабДок.Вывести(ОблКонец);	
ТабДок.ФиксацияСверху = 2;	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
